app/controllers/recipes_controller.rb

  def chooserecipe
    @recipe = Recipe.all
---
SELECT "recipes".* FROM "recipes"